#include <stdio.h>
int main(){
	int x,y;
	printf("请输入两个正整数以求其最大公约数和最小公倍数");
	scanf("%d %d",&x,&y);  //输入两个正整数
	int m=x,n=y,i,l;   //定义两个变量，用于后续的计算    //定义两个循环计数器
	if (x>y){  //如果第一个数大于第二个数
		for(i=1;m*i%n!=0;i++){};
			printf("最小公倍数为：%d\n",m*i);  //计算最小公倍数并输出
		for(l=1;m%(n-l)!=0;l++){};
			printf("最大公因数为：%d\n",n-l);  //计算最大公约数并输出
	}else if(x<y){   //如果第二个数大于第一个数
	m=y,n=x;   //交换变量m和n的值
	for(i=1;m*i%n!=0;i++){};
			printf("最小公倍数为：%d\n",m*i);  //计算最小公倍数并输出
	for(l=1;m%(n-l)!=0;l++){};
			printf("最大公因数为：%d\n",n-l);  //计算最大公约数并输出
}else{  //如果两个数相等
printf("这俩数好像相等呦");  //输出提示信息
	}
return 0;  //结束程序
} 

